//             ,%%%%%%%%,
//           ,%%/\%%%%/\%%
//          ,%%%\c "" J/%%%
// %.       %%%%/ o  o \%%%
// `%%.     %%%%    _  |%%%
//  `%%     `%%%%(__Y__)%%'
//  //       ;%%%%`\-/%%%'
// ((       /  `%%%%%%%'
//  \\    .'          |
//   \\  /       \  | |
//    \\/攻城狮保佑) | |
//     \         /_ | |__
//     (___________)))))))                   `\/'
/*
 * 修订记录:
 * long.qian 2021-10-05 13:53 创建
 */

/**
 * @author long.qian
 */

package query

// Page 分页
type Page struct {
	// 分页开始位置从 1 开始
	PageNum int `json:"pageNum"`
	// 分页大小（默认值 20），必须大于 0
	PageSize int `json:"pageSize"`
	// 总条数
	Total int64 `json:"total"`
}
